Revit 2024 API
LoadCombinationState Enumeration
 Specifies load combination state.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Since: 2016
Syntax
C#
public enum LoadCombinationState
Visual Basic
Public Enumeration LoadCombinationState
Visual C++
public enum class LoadCombinationState
Members
Member name | Description
Serviceability |  Serviceability
Ultimate |  Ultimate
See Also
Autodesk.Revit.DB.Structure Namespace